# Built In Failures Rebar Failures Rebar Hook Over End Treatment Property

Source: https://www.revitapidocs.com/2026/3fa5a594-9ed9-d49e-177f-12989d9dd467.htm

---

| Built In Failures Rebar Failures Rebar Hook Over End Treatment Property |
| --- |

Cannot add hook to the end that already has an end treatment.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarHookOverEndTreatment { get; }
```

```
Public Shared ReadOnly Property RebarHookOverEndTreatment As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarHookOverEndTreatment {
	FailureDefinitionId^ get ();
}
```

```
static member RebarHookOverEndTreatment : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace